KINOPOISK_RU_LIST = [
    'Блог команды',
    'Бюро находок',
    'В предыдущих сериях',
    'В фокусе',
    'Видеосалон',
    'Выбор редакции',
    'Главный герой',
    'Игры',
    'Индустрия',
    'Интервью',
    'Как это смотреть',
    'Кинопрофессии',
    'Киношкола',
    'Книги',
    'Крупным планом',
    'Культовое кино',
    'Культовые сериалы',
    'Мнение',
    'Плюс-минус игры',
    'Портрет героя',
    'Привет, меня зовут…',
    'Рецензии',
    'Сборы',
    'Сезонное обострение',
    'Сериалы',
    'Смотрите на Кинопоиске',
    'Спорт',
    'Трейлеры',
    'Фестивали и премии',
    'Через вселенные',
    'Шум и яркость',
    'Эволюция кинообраза',
]


















