START_MSG = """
Привет, {user_name} 👋

Я ТелеБАН - 🤖 бот нужных новостей!

Я хочу избавить тебя от инфошума, поэтому буду присылать тебе только новости, которые ты выберешь.

Для этого подпишись на категории новостей ниже в меню:
"""

INFO_MSG = """
Можно подписаться на нужные категории новостей с популярных сайтов, и бот будет оперативно их присылать.

Для управления подписками выберите в Меню пункт "Получить меню подписок".

🕯 Для отправки замечаний, пожеланий и предложений просто напишите сообщение боту.
"""

HELP_MSG = """
Справка по командам бота 💡

/start - начать работу с ботом
/help  - получить помощь
/info - получить информацию о боте
/subs - получить меню подписок
"""

SUBS_MSG = """
Перейди к нужному источнику и выбери интересную группу новостей.

Убедись, что на кнопке появился значок 🍔.

Список доступных источников 🔽:
"""

FB_MSG = """
Обратная связь отправлена разработчикам.
"""
