import pytest
from functions_hw_5 import *


def test_create_set_1():
    '''тест создания множества set1 из целых чисел: 1, 2, 3, 4, 5'''
    set1 = create_set_1()
    assert set1 == {1, 2, 3, 4, 5}, 'Ошибка создания множества'


def test_add_element_to_set():
    '''Тест-проверка добавен ли в это множество элемент 6'''
    set1 = {1, 2, 3, 4, 5}
    set1 = add_element_to_set(set1)
    assert set1 == {1, 2, 3, 4, 5, 6}, 'Ошибка добавления элемента'


def test_remove_element_from_set():
    '''Тест удален ли элемент 2 из множества '''
    set1 = {1, 2, 3, 4, 5, 6}
    set1 = remove_element_from_set(set1)
    assert set1 == {1, 3, 4, 5, 6}, 'Ошибка удаления элемента'


def test_has_element_in_set():
    '''Проверьте, содержит ли множество элемент 3'''
    set1 = {1, 3, 4, 5, 6}
    result = has_element_in_set(set1, x)
    assert result == True, 'Ошибка в содержании элемента 3 в множестве'


def test_create_set_2():
    '''Тест на создание второго множества set2 с элементами 4, 5, 6, 7, 8'''
    set2 = create_set_2()
    assert set2 == {4, 5, 6, 7, 8}, 'Ошибка создания множества'

 
def test_find_union_sets():
    '''Тест на объединение множеств set1 и set2'''
    set1 = {1, 3, 4, 5, 6}
    set2 = {4, 5, 6, 7, 8}
    result = find_union_sets(set1, set2)
    assert result == {1, 3, 4, 5, 6, 7, 8}  



def test_difference_sets():
    '''Найдите разность множеств set1 и set2'''
    set1 = {1, 3, 4, 5, 6}
    set2 = {4, 5, 6, 7, 8}
    result = difference_sets(set1,set2)
    assert result == {1, 3}


def test_create_sets_of_rainbows():
    ''' Создайте два множества set1 и set2, содержащие цвета радуги: 
    "красный", "оранжевый", "желтый", "зеленый", "голубой", "синий", "фиолетовый" 
    и "оранжевый", "зеленый", "голубой", "синий", "Мальвиновый".'''

    set1 = {"красный", "оранжевый", "желтый", "зеленый", "голубой", "синий", "фиолетовый"}
    set2 = {"оранжевый", "зеленый", "голубой", "синий", "Мальвиновый"}
    result = create_sets_of_rainbows(set1, set2)
    assert result == ({'голубой','желтый','зеленый','красный','оранжевый','синий','фиолетовый'},
 {'Мальвиновый', 'голубой', 'зеленый', 'оранжевый', 'синий'}) 


 
def test_intersection_of_sets():
    '''Тест на нахождение пересечения множеств set1 и set2'''

    set1 = {"красный", "оранжевый", "желтый", "зеленый", "голубой", "синий", "фиолетовый"}
    set2 = {"оранжевый", "зеленый", "голубой", "синий", "Мальвиновый"}
    
    result = intersection_of_sets(set1, set2)
    assert result == {'голубой', 'зеленый', 'оранжевый', 'синий'}



def test_union_sets_in_new_set():
    '''Тест на объединение множества set1 и set2 и сохр результата в новое множество rainbow_colors'''

    set1 = {"красный", "оранжевый", "желтый", "зеленый", "голубой", "синий", "фиолетовый"}
    set2 = {"оранжевый", "зеленый", "голубой", "синий", "Мальвиновый"}

    result = union_sets_in_new_set(set1, set2)
    assert result == {'Мальвиновый','голубой','желтый','зеленый','красный','оранжевый','синий','фиолетовый'}

